РП/src/Catalogs/УзлыОбъектовЭксплуатации/УзлыОбъектовЭксплуатации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УзлыОбъектовЭксплуатации</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.ОбъектыЭксплуатации</owners>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Класс</name>
    <type>
      <types>CatalogRef.КлассыОбъектовЭксплуатации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подкласс</name>
    <type>
      <types>CatalogRef.ПодклассыОбъектовЭксплуатации</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыОбъектовЭксплуатации</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяРасходов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВлияетНаДоступностьРЦ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РемонтирующееПодразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Модель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерийныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Расположение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Принадлежность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПараметрыУчетаНаработок</name>
    <attributes>
      <name>ПоказательНаработки</name>
      <type>
        <types>CatalogRef.ПоказателиНаработки</types>
      </type>
    </attributes>
    <attributes>
      <name>НазначенныйРесурс</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Источник</name>
      <type>
        <types>CatalogRef.ОбъектыЭксплуатации</types>
        <types>CatalogRef.УзлыОбъектовЭксплуатации</types>
      </type>
    </attributes>
    <attributes>
      <name>СмещениеЗначения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

РП/src/Enums/СтатусыОбъектовЭксплуатации/СтатусыОбъектовЭксплуатации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыОбъектовЭксплуатации</name>
  <enumValues>
    <name>ВЭксплуатации</name>
  </enumValues>
  <enumValues>
    <name>Редактируется</name>
  </enumValues>
  <enumValues>
    <name>Ликвидирован</name>
  </enumValues>
</mdclass:Enum>

РП/src/Catalogs/УзлыОбъектовЭксплуатации/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Процедура инициализации дополнительных свойств узла для последующей записи
//
Процедура ИнициализироватьДополнительныеСвойстваДляЗаписи(ЗначенияДополнительныхСвойств = Неопределено) Экспорт
	
	Если ДополнительныеСвойства.Свойство("ИнициализированыДляЗаписи") Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый());
	ДополнительныеСвойства.Вставить("ЭтоПодчиненный", ЗначениеЗаполнено(Родитель));
	ДополнительныеСвойства.Вставить("РаспространитьСтатус", Статус = Перечисления.СтатусыОбъектовЭксплуатации.Ликвидирован);
	ДополнительныеСвойства.Вставить("ОбновитьНаименованиеПолное", ПустаяСтрока(НаименованиеПолное));
	
	Если ЗначенияДополнительныхСвойств = Неопределено Тогда
		
		ДополнительныеСвойства.Вставить("ЗаписьИзВнешнегоОбъекта", Ложь);
		ДополнительныеСвойства.Вставить("ЗначенияЗаполнения", Неопределено);
		ДополнительныеСвойства.Вставить("ДействияЗаполнения", Неопределено);
		
		ДополнительныеСвойства.Вставить("ТребуетсяЗаполнениеПодчиненных", Ложь);
		ДополнительныеСвойства.Вставить("ЗначенияЗаполненияПодчиненных", Новый Структура);
		ДополнительныеСвойства.Вставить("ДействияЗаполненияПодчиненных", Новый Структура);
		
		Если ДополнительныеСвойства.ЭтоНовый Тогда
			
			ДополнительныеСвойства.Вставить(
				"РеквизитыДоЗаписи",
				Новый Структура("Наименование, НаименованиеПолное, Владелец, Родитель, Статус"));
			
			ЗаполнитьЗначенияСвойств(ДополнительныеСвойства.РеквизитыДоЗаписи, ЭтотОбъект);
			
		Иначе
			
			ДополнительныеСвойства.Вставить(
				"РеквизитыДоЗаписи",
				ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "Наименование, НаименованиеПолное, Владелец, Родитель, Статус"));
			
		КонецЕсли;
		
		ДополнительныеСвойства.ОбновитьНаименованиеПолное = (
			ПустаяСтрока(НаименованиеПолное)
			Или (НаименованиеПолное = ДополнительныеСвойства.РеквизитыДоЗаписи.НаименованиеПолное
				И ДополнительныеСвойства.РеквизитыДоЗаписи.НаименованиеПолное = ДополнительныеСвойства.РеквизитыДоЗаписи.Наименование));
		
		Если ДополнительныеСвойства.ЭтоПодчиненный Тогда
			
			ДополнительныеСвойства.Вставить(
				"РеквизитыРодителя",
				ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Родитель, "Статус"));
			
			ДополнительныеСвойства.Вставить(
				"БратьСтатусОтРодителя",
				ДополнительныеСвойства.РеквизитыРодителя.Статус = Перечисления.СтатусыОбъектовЭксплуатации.Ликвидирован);
			
			ДополнительныеСвойства.Вставить(
				"РаспространитьСтатус",
				ДополнительныеСвойства.БратьСтатусОтРодителя);
			
		КонецЕсли;
		
	Иначе
		
		ОбщегоНазначенияУТКлиентСервер.ДополнитьСтруктуру(ДополнительныеСвойства, ЗначенияДополнительныхСвойств, Истина);
		
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ИнициализированыДляЗаписи");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	
	Если ТипДанныхЗаполнения = Тип("Структура") Тогда
		
		ЗаполнитьНаОснованииСтруктуры(ДанныеЗаполнения);
		
	КонецЕсли;
	
	ИнициализироватьСправочник();
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ИнициализироватьСправочник();
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	УстановитьПривилегированныйРежим(Истина);
	
	ИнициализироватьДополнительныеСвойстваДляЗаписи();
	
	Если ДополнительныеСвойства.ЗаписьИзВнешнегоОбъекта Тогда
		ПередЗаписьюИзВнешнегоОбъекта(Отказ);
		Возврат;
		
	КонецЕсли;
	
	Если ДополнительныеСвойства.ОбновитьНаименованиеПолное Тогда
		
		НаименованиеПолное = Наименование;
		
	КонецЕсли;
	
	Если ДополнительныеСвойства.ЭтоПодчиненный И ДополнительныеСвойства.БратьСтатусОтРодителя Тогда
		Если ДополнительныеСвойства.РеквизитыРодителя.Статус <> Статус Тогда
			Статус = ДополнительныеСвойства.РеквизитыРодителя.Статус;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ДополнительныеСвойства.ЭтоНовый Тогда
		
		ЗаполнитьПринадлежность();
		
	Иначе
		
		Если ДополнительныеСвойства.РеквизитыДоЗаписи.Наименование <> Наименование Тогда
			
			ЗаполнитьПринадлежность();
			
			ДополнительныеСвойства.ТребуетсяЗаполнениеПодчиненных = Истина;
			ДополнительныеСвойства.ДействияЗаполненияПодчиненных.Вставить("ЗаполнитьПринадлежность");
			
		КонецЕсли;
		
		Если ДополнительныеСвойства.РеквизитыДоЗаписи.Статус <> Статус
			И ДополнительныеСвойства.РаспространитьСтатус Тогда
			
			ДополнительныеСвойства.ТребуетсяЗаполнениеПодчиненных = Истина;
			ДополнительныеСвойства.ЗначенияЗаполненияПодчиненных.Вставить("Статус", Статус);
			
		КонецЕсли;
		
		Если ДополнительныеСвойства.РеквизитыДоЗаписи.Владелец <> Владелец Тогда
			ДополнительныеСвойства.ТребуетсяЗаполнениеПодчиненных = Истина;
			ДополнительныеСвойства.ЗначенияЗаполненияПодчиненных.Вставить("Владелец", Владелец);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.ЗаписьИзВнешнегоОбъекта Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ДополнительныеСвойства.ТребуетсяЗаполнениеПодчиненных Тогда
		
		СтруктураДополнительныхСвойств = Новый Структура;
		СтруктураДополнительныхСвойств.Вставить("ЭтоНовый", Ложь);
		СтруктураДополнительныхСвойств.Вставить("ЗаписьИзВнешнегоОбъекта", Истина);
		СтруктураДополнительныхСвойств.Вставить("ЗначенияЗаполнения", ДополнительныеСвойства.ЗначенияЗаполненияПодчиненных);
		СтруктураДополнительныхСвойств.Вставить("ДействияЗаполнения", ДополнительныеСвойства.ДействияЗаполненияПодчиненных);
		СтруктураДополнительныхСвойств.Вставить("ТребуетсяЗаполнениеПодчиненных", Ложь);
		
		СтруктураОтбора = Новый Структура("Родитель", Ссылка);
		
		Справочники.УзлыОбъектовЭксплуатации.ЗаполнитьПоОтбору(СтруктураОтбора, СтруктураДополнительныхСвойств, Отказ);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Стандартный механизм проверки заполнения применяется только для проверки стандартных реквизитов: "Наименование", "Код" и "Владелец"
	// Проверка реквизитов, доп. реквизитов и табличных частей инициируется владельцем (объектом эксплуатации) или формой элемента узла.
	
	ПроверяемыеРеквизиты.Очистить();
	
	ПроверяемыеРеквизиты.Добавить("Наименование");
	ПроверяемыеРеквизиты.Добавить("Владелец");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ИнициализироватьСправочник()
	
	Статус = Перечисления.СтатусыОбъектовЭксплуатации.ВЭксплуатации;
	
КонецПроцедуры

Процедура ПередЗаписьюИзВнешнегоОбъекта(Отказ)
	
	Если ДополнительныеСвойства.ЗначенияЗаполнения <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДополнительныеСвойства.ЗначенияЗаполнения);
	КонецЕсли;
	
	Если ДополнительныеСвойства.ДействияЗаполнения <> Неопределено Тогда
		
		Если ДополнительныеСвойства.ДействияЗаполнения.Свойство("ЗаполнитьПринадлежность") Тогда
			
			ЗаполнитьПринадлежность();
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьНаОснованииСтруктуры(ДанныеЗаполнения)
	
	Если ДанныеЗаполнения.Свойство("Родитель") Тогда
		РеквизитыРодителя = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеЗаполнения.Родитель, "Статус");
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, РеквизитыРодителя);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьПринадлежность()
	
	Результат = "";
	
	Разделитель = "\";
	
	ПолныйПуть = ЭтотОбъект.ПолноеНаименование();
	ПолныйПуть = СтрЗаменить(ПолныйПуть, "/", Символы.ПС);
	
	Для н=1 По СтрЧислоСтрок(ПолныйПуть) Цикл
		Результат = Разделитель + СтрПолучитьСтроку(ПолныйПуть, н) + Результат;
	КонецЦикла;
	
	Принадлежность = Сред(Результат, 2) + Разделитель + Строка(ЭтотОбъект.Владелец);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
